# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N. Факториал
# 5! = 120

import math
number = input("Введите число: ")
print(math.factorial(int(number)))